if __name__ == "__main__":
  # Задание №4 из ЕГЭ профиль [https://math-ege.sdamgia.ru/problem?id=282856]
  # При производстве в среднем на каждые 2982 исправных насоса приходится 18 неисправных. Найдите вероятность того, что случайно выбранный насос окажется неисправным.
  p = 18 / (2982+18)
  print(p)
  # Задача была решена и использованием формулы из теории вероятностей. К решению приложена ссылка на источник, а расчёты можно проверить вручную.
  python3 *lab/main.py
